{
    "sections": [
      {
        "titre": "Préambule",
        "introduction": "L’enseignement de **sciences numériques et technologie** en classe de seconde a pour objet de permettre d’appréhender les principaux concepts des sciences numériques, mais également de comprendre le poids croissant du numérique et les enjeux qui en découlent. [...] Ce programme s’appuie sur la maîtrise des compétences numériques acquises au collège et approfondit la pratique de la programmation."
      },
      {
        "titre": "Notions transversales de programmation",
        "introduction": "Un langage de programmation est nécessaire pour l’écriture des programmes, ici **Python 3** (ou supérieur). Les élèves doivent savoir utiliser des **variables**, **séquences**, **conditions**, **boucles**, **fonctions**."
      }
    ],
    "elements": [
      {
        "titre": "Internet",
        "introduction": "Grâce à sa souplesse et à son universalité, **internet** est devenu le moyen de communication principal entre les hommes et avec les machines.",
        "items": [
          {
            "contenus": "Protocole TCP/IP : paquets, routage des paquets",
            "capacités": "Distinguer le rôle des protocoles IP et TCP. Caractériser les principes du routage et ses limites. Distinguer la fiabilité de transmission et l’absence de garantie temporelle.",
            "commentaires": ""
          },
          {
            "contenus": "Adresses symboliques et serveurs DNS",
            "capacités": "Sur des exemples réels, retrouver une adresse IP à partir d’une adresse symbolique et inversement.",
            "commentaires": ""
          },
          {
            "contenus": "Réseaux pair-à-pair",
            "capacités": "Décrire l’intérêt des réseaux pair-à-pair ainsi que les usages illicites qu’on peut en faire.",
            "commentaires": ""
          },
          {
            "contenus": "Indépendance d’internet par rapport au réseau physique",
            "capacités": "Caractériser quelques types de réseaux physiques : obsolètes ou actuels, rapides ou lents, filaires ou non. Caractériser l’ordre de grandeur du trafic de données sur internet et son évolution.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "Le Web",
        "introduction": "Le **Web** est un système donnant accès à des données reliées par des liens hypertextes accessibles via internet.",
        "items": [
          {
            "contenus": "Repères historiques",
            "capacités": "Connaître les étapes du développement du Web.",
            "commentaires": ""
          },
          {
            "contenus": "Notions juridiques",
            "capacités": "Connaître certaines notions juridiques (licence, droit d’auteur, droit d’usage, valeur d’un bien).",
            "commentaires": ""
          },
          {
            "contenus": "Hypertexte",
            "capacités": "Maîtriser les renvois d’un texte à différents contenus.",
            "commentaires": ""
          },
          {
            "contenus": "Langages HTML et CSS",
            "capacités": "Distinguer ce qui relève du contenu d’une page et de son style de présentation. Étudier et modifier une page HTML simple.",
            "commentaires": ""
          },
          {
            "contenus": "URL",
            "capacités": "Décomposer l’URL d’une page. Reconnaître les pages sécurisées.",
            "commentaires": ""
          },
          {
            "contenus": "Requête HTTP",
            "capacités": "Décomposer le contenu d’une requête HTTP et identifier les paramètres passés.",
            "commentaires": ""
          },
          {
            "contenus": "Modèle client/serveur",
            "capacités": "Inspecter le code d’une page hébergée par un serveur et distinguer ce qui est exécuté par le client et par le serveur.",
            "commentaires": ""
          },
          {
            "contenus": "Moteurs de recherche : principes et usages",
            "capacités": "Mener une analyse critique des résultats fournis par un moteur de recherche. Comprendre les enjeux de la publication d’informations.",
            "commentaires": ""
          },
          {
            "contenus": "Paramètres de sécurité d’un navigateur",
            "capacités": "Maîtriser les réglages les plus importants concernant la gestion des cookies, la sécurité et la confidentialité d’un navigateur. Sécuriser sa navigation en ligne et analyser les pages et fichiers.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "Les réseaux sociaux",
        "introduction": "Les **réseaux sociaux** sont des applications du Web qui permettent de mettre en relation les internautes et de créer des communautés.",
        "items": [
          {
            "contenus": "Identité numérique, e-réputation, identification, authentification",
            "capacités": "Connaître les principaux concepts liés à l’usage des réseaux sociaux.",
            "commentaires": ""
          },
          {
            "contenus": "Réseaux sociaux existants",
            "capacités": "Distinguer plusieurs réseaux sociaux selon leurs caractéristiques, y compris un ordre de grandeur de leurs nombres d’abonnés. Paramétrer des abonnements pour assurer la confidentialité de données personnelles.",
            "commentaires": ""
          },
          {
            "contenus": "Modèle économique des réseaux sociaux",
            "capacités": "Identifier les sources de revenus des entreprises de réseautage social.",
            "commentaires": ""
          },
          {
            "contenus": "Rayon, diamètre et centre d’un graphe",
            "capacités": "Déterminer ces caractéristiques sur des graphes simples.",
            "commentaires": ""
          },
          {
            "contenus": "Notion de \"petit monde\", expérience de Milgram",
            "capacités": "Décrire comment l’information présentée par les réseaux sociaux est conditionnée par le choix préalable de ses amis.",
            "commentaires": ""
          },
          {
            "contenus": "Cyberviolence",
            "capacités": "Connaître les dispositions de l’article 222-33-2-2 du code pénal. Connaître les différentes formes de cyberviolence (harcèlement, discrimination, sexting...) et les ressources disponibles pour lutter contre la cyberviolence.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "Les données structurées et leur traitement",
        "introduction": "Les **données** constituent la matière première de toute activité numérique. Les structurer correctement permet leur exploitation et réutilisation efficace.",
        "items": [
          {
            "contenus": "Données",
            "capacités": "Définir une donnée personnelle. Identifier les principaux formats et représentations de données.",
            "commentaires": ""
          },
          {
            "contenus": "Données structurées",
            "capacités": "Identifier les différents descripteurs d’un objet. Distinguer la valeur d’une donnée de son descripteur. Utiliser un site de données ouvertes pour sélectionner et récupérer des données.",
            "commentaires": ""
          },
          {
            "contenus": "Traitement de données structurées",
            "capacités": "Réaliser des opérations de recherche, filtre, tri ou calcul sur une ou plusieurs tables.",
            "commentaires": ""
          },
          {
            "contenus": "Métadonnées",
            "capacités": "Retrouver les métadonnées d’un fichier personnel.",
            "commentaires": ""
          },
          {
            "contenus": "Données dans le nuage (cloud)",
            "capacités": "Utiliser un support de stockage dans le nuage. Partager des fichiers, paramétrer des modes de synchronisation. Identifier les principales causes de la consommation énergétique des centres de données ainsi que leur ordre de grandeur.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "Localisation, cartographie et mobilité",
        "introduction": "La **cartographie numérique** et les systèmes de localisation (comme le GPS) permettent d'afficher des cartes interactives et de calculer des itinéraires, transformant de nombreux usages dans les transports, les loisirs ou l’agriculture.",
        "items": [
          {
            "contenus": "GPS, Galileo",
            "capacités": "Décrire le principe de fonctionnement de la géolocalisation.",
            "commentaires": ""
          },
          {
            "contenus": "Cartes numériques",
            "capacités": "Identifier les différentes couches d’information de GeoPortail pour extraire différents types de données. Contribuer à OpenStreetMap de façon collaborative.",
            "commentaires": ""
          },
          {
            "contenus": "Protocole NMEA 0183",
            "capacités": "Décoder une trame NMEA pour trouver des coordonnées géographiques.",
            "commentaires": ""
          },
          {
            "contenus": "Calculs d’itinéraires",
            "capacités": "Utiliser un logiciel pour calculer un itinéraire. Représenter un calcul d’itinéraire comme un problème sur un graphe.",
            "commentaires": ""
          },
          {
            "contenus": "Confidentialité",
            "capacités": "Régler les paramètres de confidentialité d’un téléphone pour partager ou non sa position.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "Informatique embarquée et objets connectés",
        "introduction": "L’**informatique embarquée** permet aux objets d’intégrer des fonctionnalités numériques, de gagner en autonomie et de se connecter à d’autres systèmes.",
        "items": [
          {
            "contenus": "Systèmes informatiques embarqués",
            "capacités": "Identifier des algorithmes de contrôle des comportements physiques à travers les données des capteurs, l’IHM et les actions des actionneurs dans des systèmes courants.",
            "commentaires": ""
          },
          {
            "contenus": "Interface homme-machine (IHM)",
            "capacités": "Réaliser une IHM simple d’un objet connecté.",
            "commentaires": ""
          },
          {
            "contenus": "Commande d’un actionneur, acquisition des données d’un capteur",
            "capacités": "Écrire des programmes simples d’acquisition de données ou de commande d’un actionneur.",
            "commentaires": ""
          }
        ]
      },
      {
        "titre": "La photographie numérique",
        "introduction": "La **photographie numérique** repose sur des capteurs, des pixels et des algorithmes pour produire, traiter et diffuser les images. Elle transforme radicalement les usages et les enjeux liés à l’image.",
        "items": [
          {
            "contenus": "Photosites, pixels, résolution (du capteur, de l’image), profondeur de couleur",
            "capacités": "Distinguer les photosites du capteur et les pixels de l’image en comparant les résolutions du capteur et de l’image selon les réglages de l’appareil.",
            "commentaires": ""
          },
          {
            "contenus": "Métadonnées EXIF",
            "capacités": "Retrouver les métadonnées d’une photographie.",
            "commentaires": ""
          },
          {
            "contenus": "Traitement d’image",
            "capacités": "Traiter par programme une image pour la transformer en agissant sur les trois composantes de ses pixels.",
            "commentaires": ""
          },
          {
            "contenus": "Rôle des algorithmes dans les appareils photo numériques",
            "capacités": "Expliciter des algorithmes associés à la prise de vue. Identifier les étapes de la construction de l’image finale.",
            "commentaires": ""
          }
        ]
      }
    ]
  }