    {
      "id": 1,
      "label": "Lycée Général",
      "abrv": "LG",
      "niveaux": [
        {
          "id": 1,
          "label": "Première",
          "id_univers": 1,
          "abrv": "1ère",
          "matieres": [
            {
              "id": 1,
              "id_niveau": 1,
              "label": "NSI",
              "comment": "NSI 1ère",
              "parties": [
                {
                  "id": 2,
                  "label": "Histoire de l'informatique",
                  "commentaires": "Cette rubrique transversale se décline dans chacune des sept autres.\n\nComme toute connaissance scientifique et technique, les concepts de l’informatique ont une histoire et ont été forgés par des personnes. Les algorithmes sont présents dès l’Antiquité, les machines à calculer apparaissent progressivement au XVIIe siècle, les sciences de l’information sont fondées au XIXe siècle, mais c’est en 1936 qu’apparaît le concept de machine universelle, capable d’exécuter tous les algorithmes, et que les notions de machine, algorithme, langage et information sont pensées comme un tout cohérent. Les premiers ordinateurs ont été construits en 1948 et leur puissance a ensuite évolué exponentiellement. \n\nParallèlement, les ordinateurs se sont diversifiés dans leur taille, leur forme et leur emploi : téléphones, tablettes, montres connectées, ordinateurs personnels, serveurs, fermes de calcul, méga-ordinateurs. Le réseau internet, développé depuis 1969, relie aujourd’hui ordinateurs et objets connectés.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 1,
                      "contenu": "**Évènements** clés de l'histoire de l'informatique",
                      "capacites": "Situer dans les temps les principaux évènements de l'histoire de l'informatique et leurs protagonistes.",
                      "commentaires": "Ces repères historiques seront construits au fur et à mesure de la présentation des concepts et techniques.",
                      "id_partie": 2
                    },
                    {
                      "id": 4,
                      "contenu": "Représentation approximative des nombres réels : notion de nombre flottant",
                      "capacites": "Calculer sur quelques exemples la représentation de nombres réels : 0.1, 0.25 ou 1/3.",
                      "commentaires": "0.2 + 0.1 n'est pas égal à 0.3.\n\nIl faut éviter de tester l'égalité de deux flottants.\n\nAucune connaissance précise de la norme IEEE-754 n'est exigible.",
                      "id_partie": 2
                    }
                  ]
                },
                {
                  "id": 3,
                  "label": "Représentation des données : types et valeurs de base",
                  "commentaires": "Toute machine informatique manipule une représentation des données dont l’unité minimale est le bit 0/1, ce qui permet d’unifier logique et calcul. Les données de base sont représentées selon un codage dépendant de leur nature : entiers, flottants, caractères et chaînes de caractères. Le codage conditionne la taille des différentes valeurs en mémoire.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 2,
                      "contenu": "Écriture d'un envier positif dans une base $b \\leq 2$",
                      "capacites": "Passer de la représentation d'une base dans une autre.",
                      "commentaires": "Les bases 2, 10 et 16 sont privilégiées.",
                      "id_partie": 3
                    },
                    {
                      "id": 3,
                      "contenu": "Représentation binaire d'un entier relatif",
                      "capacites": "Évaluer le nombre de bits nécessaires à l'écriture en base 2 d'un entier, de la somme ou du produit de deux nombres entiers.\n\nUtiliser le complément à 2.",
                      "commentaires": "Il s'agit de décrire les tailles courantes des entiers (8, 16, 32 ou 64 bits). \n\nIl est possible d'évoquer la représentation des entiers de taille arbitraire de Python.",
                      "id_partie": 3
                    },
                    {
                      "id": 5,
                      "contenu": "Valeurs booléennes : 0, 1. Opérateurs booléens : and, or, not.\n\nExpressions booléennes.",
                      "capacites": "Dresser la table d'une expression booléenne.",
                      "commentaires": "Le ou exclusif (xor) est évoqué.\n\nQuelques applications directes comme l'addition binaire sont présentées.\n\nL'attention des élèves est attirée sur le caractère séquentiel de certains opérateurs booléens.",
                      "id_partie": 3
                    },
                    {
                      "id": 6,
                      "contenu": "Représentation d'un texte en machine.\n\nExemple des encodages ASCII, ISO-8859-1, Unicode",
                      "capacites": "Identifier l'intérêt des différents systèmes d'encodage.\n\nConvertir un fichier texte dans différents formats d'encodage.",
                      "commentaires": "Aucune connaissance précise des normes d'encodage n'est exigible.",
                      "id_partie": 3
                    }
                  ]
                },
                {
                  "id": 4,
                  "label": "Représentation des données : types construits",
                  "commentaires": "À partir des types de base se constituent des types construits, qui sont introduits au fur et à mesure qu’ils sont nécessaires. \n\nIl s’agit de présenter tour à tour les p-uplets (tuples), les enregistrements qui collectent des valeurs de types différents dans des champs nommés et les tableaux qui permettent un accès calculé direct aux éléments. En pratique, on utilise les appellations de Python, qui peuvent être différentes de celles d’autres langages de programmation.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 7,
                      "contenu": "p-uplets\n\np-uplets nommés",
                      "capacites": "Écrire une fonction renvoyant un p-uplet de valeurs.",
                      "commentaires": "",
                      "id_partie": 4
                    },
                    {
                      "id": 8,
                      "contenu": "Tableau indexé, tableau donné en compréhension",
                      "capacites": "Lire et modifier les éléments d'un tableau grâce à leurs index.\n\nConstruire un tableau par compréhension.\n\nUtiliser des tableaux de tableaux pour représenter des matrices : notation `a[i][j]`.\n\nItérer sur les éléments d'un tableau.",
                      "commentaires": "Seuls les tableaux dont les éléments sont du même type sont présentés.\n\nAucune connaissance des tranches (*slices*) n'est exigible.\n\nL'aspect dynamique des tableaux de Python n'est pas évoqué. Python identifie listes et tableaux.\n\nIl n'est pas fait référence aux tableaux de la bibliothèque NumPy.",
                      "id_partie": 4
                    },
                    {
                      "id": 9,
                      "contenu": "Dictionnaires par clés et valeurs",
                      "capacites": "Construire une entrée de dictionnaire.\n\nItérer sur les éléments d'un dictionnaire.",
                      "commentaires": "Il est possible de présenter les données EXIF d'une image sous la forme d'un enregistrement.\n\nEn Python, les p-uplets nommés sont implémentés par des dictionnaires.\n\nUtiliser les méthodes `keys()`, `values()` et `items()`.",
                      "id_partie": 4
                    }
                  ]
                },
                {
                  "id": 5,
                  "label": "Traitement des données en tables",
                  "commentaires": "Les données organisées en table correspondent à une liste de p-uplets nommés qui partagent les mêmes descripteurs. La mobilisation de ce type de structure de données permet de préparer les élèves à aborder la notion de base de données qui ne sera présentée qu’en classe terminale. Il s’agit d’utiliser un tableau doublement indexé ou un tableau de p-uplets, dans un langage de programmation ordinaire et non dans un système de gestion de bases de données.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 10,
                      "contenu": "Indexation de tables",
                      "capacites": "Importer une table depuis un fichier texte tabulé ou un fichier CSV.",
                      "commentaires": "Est utilisé un tableau doublement indexé ou un tableau de p-uplets qui partagent les mêmes descripteurs.",
                      "id_partie": 5
                    },
                    {
                      "id": 11,
                      "contenu": "Recherche dans une table",
                      "capacites": "Rechercher les lignes d'une table vérifiant des critères exprimés en logique propositionnelle.",
                      "commentaires": "La recherche de doublons, les tests de cohérence d'une table sont présentés.",
                      "id_partie": 5
                    },
                    {
                      "id": 12,
                      "contenu": "Tri d'une table",
                      "capacites": "Trier une table suivant une colonne.",
                      "commentaires": "Une fonction de tri intégrée au système ou à une bibliothèque peut être utilisée.",
                      "id_partie": 5
                    },
                    {
                      "id": 13,
                      "contenu": "Fusion de tables",
                      "capacites": "Construire une nouvelle table en combinant les données de deux tables.",
                      "commentaires": "La notion de domaine de valeurs est mise en évidence.",
                      "id_partie": 5
                    }
                  ]
                },
                {
                  "id": 6,
                  "label": "Interactions entre l'Homme et la machine sur le Web",
                  "commentaires": "Lors de la navigation sur le Web, les internautes interagissent avec leur machine par le biais des pages Web.\n\nL’Interface Homme-Machine (IHM) repose sur la gestion d’événements associés à des éléments graphiques munis de méthodes algorithmiques.\n\nLa compréhension du dialogue client-serveur déjà abordé en classe de seconde est consolidée, sur des exemples simples, en identifiant les requêtes du client, les calculs puis les réponses du serveur traitées par le client.\n\nIl ne s’agit pas de décrire exhaustivement les différents éléments disponibles, ni de développer une expertise dans les langages qui permettent de mettre en œuvre le dialogue tels que PHP ou JavaScript.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 14,
                      "contenu": "Modalités de l'interaction entre l'Homme et la machine\n\nÉvènements",
                      "capacites": "Identifier les différents composants graphiques permettant d'interagir avec une application Web.\n\nIdentifier les évènements que les fonctions associées aux différents composants graphiques sont capables de traiter.",
                      "commentaires": "Il s'agit d'examiner le code HTML d'une page comprenant des composants graphiques et de distinguer ce qui relève de la description des composants graphiques en HTML de leur comportement (réaction aux évènementsà programmé par exemple en JavaScript.",
                      "id_partie": 6
                    },
                    {
                      "id": 15,
                      "contenu": "Interaction avec l'utilisateur dans une page Web",
                      "capacites": "Analyser et modifier les méthodes exécutées lors d'un clic sur un bouton d'une page Web.",
                      "commentaires": "",
                      "id_partie": 6
                    },
                    {
                      "id": 16,
                      "contenu": "Interaction client-serveur.\n\nRequêtes HTTP, réponses du serveur",
                      "capacites": "Distinguer ce qui est exécuter sur le client ou sur le serveur et dans quel ordre.\n\nDistinguer ce qui est mémorisé dans le client et retransmis au serveur.\n\nReconnaître quand et pourquoi la transmission est chiffrée.",
                      "commentaires": "Il s'agit de faire le lien avec ce qui a été vu en classe de seconde et d'expliquer comment on peut passer des paramètres à un site grâce au protocole HTTP.",
                      "id_partie": 6
                    },
                    {
                      "id": 17,
                      "contenu": "Formulaire d'une page Web",
                      "capacites": "Analyser le fonctionnement d'un formulaire simple.\n\nDistinguer les transmissions de paramètres par les requêtes POST ou GET.",
                      "commentaires": "Discuter les deux types de requêtes selon le type des valeurs à transmettre et/ou leur confidentialité.",
                      "id_partie": 6
                    }
                  ]
                },
                {
                  "id": 7,
                  "label": "Architectures matérielles et systèmes d'exploitation",
                  "commentaires": "Exprimer un algorithme dans un langage de programmation a pour but de le rendre exécutable par une machine dans un contexte donné. La découverte de l’architecture des machines et de leur système d’exploitation constitue une étape importante.\n\nLes circuits électroniques sont au cœur de toutes les machines informatiques. Les réseaux permettent de transmettre l’information entre machines. Les systèmes d’exploitation gèrent et optimisent l’ensemble des fonctions de la machine, de l’exécution des programmes aux entrées-sorties et à la gestion d’énergie.\n\nOn étudie aussi le rôle des capteurs et actionneurs dans les entrées-sorties clavier, interfaces graphiques et tactiles, dispositifs de mesure physique, commandes de machines, etc.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 18,
                      "contenu": "Modèles d'architecture séquentielle (von Neumann)",
                      "capacites": "Distinguer les rôles et les caractéristiques des différents constituants d'une machine.\n\nDérouler l'exécution d'une séquence d'instructions simples du type langage machine.",
                      "commentaires": "La présentation se limite aux concepts généraux.\n\nOn distingue les architectures monoprocesseur et les architectures multiprocesseur.\n\nDes activités débranchées sont proposées.\n\nLes circuits combinatoires réalisent des fonctions booléennes.",
                      "id_partie": 7
                    },
                    {
                      "id": 19,
                      "contenu": "Transmission de données dans un réseau\n\nProtocoles de communication\n\nArchitecture d’un réseau",
                      "capacites": "Mettre en évidence l’intérêt du découpage des données en paquets et de leur encapsulation.\n\nDérouler le fonctionnement d’un protocole simple de récupération de perte de paquets (bit alterné).\n\nSimuler ou mettre en œuvre un réseau.",
                      "commentaires": "Le protocole peut être expliqué et simulé en mode débranché.\n\nLe lien est fait avec ce qui a été vu en classe de seconde sur le protocole TCP/IP.\n\nLe rôle des différents constituants du réseau local de l’établissement est présenté.",
                      "id_partie": 7
                    },
                    {
                      "id": 20,
                      "contenu": "Systèmes d'exploitation",
                      "capacites": "Identifier les fonctions d’un système d’exploitation.\n\nUtiliser les commandes de base en ligne de commande.\n\nGérer les droits et permissions d’accès aux fichiers.",
                      "commentaires": "Les différences entre systèmes d’exploitation libres et propriétaires sont évoquées.\n\nLes élèves utilisent un système d’exploitation libre.\n\nIl ne s’agit pas d’une étude théorique des systèmes d’exploitation.",
                      "id_partie": 7
                    },
                    {
                      "id": 21,
                      "contenu": "Périphériques d’entrée et de sortie\n\nInterface Homme- Machine (IHM)",
                      "capacites": "Identifier le rôle des capteurs et actionneurs.\n\nRéaliser par programmation une IHM répondant à un cahier des charges donné.",
                      "commentaires": "Les activités peuvent être développées sur des objets connectés, des systèmes embarqués ou robots.",
                      "id_partie": 7
                    }
                  ]
                },
                {
                  "id": 8,
                  "label": "Langages et programmation",
                  "commentaires": "Les langages de programmation Turing-complets sont caractérisés par un corpus de « constructions élémentaires ». Sans introduire cette terminologie, il s’agit de montrer qu’il existe de nombreux langages de programmation, différents par leur style (impératif, fonctionnel, objet, logique, événementiel, etc.), ainsi que des langages formalisés de description ou de requêtes qui ne sont pas des langages de programmation.\n\nL’importance de la spécification, de la documentation et des tests est à présenter, ainsi que l’intérêt de la modularisation qui permet la réutilisation de programmes et la mise à disposition de bibliothèques. Pour les programmes simples écrits par les élèves, on peut se contenter d’une spécification rapide mais précise.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 22,
                      "contenu": "Constructions élémentaires",
                      "capacites": "Mettre en évidence un corpus de constructions élémentaires.",
                      "commentaires": "Séquences affectation, conditionnelles, boucles bornées, boucles non bornées, appels de fonction.",
                      "id_partie": 8
                    },
                    {
                      "id": 23,
                      "contenu": "Diversité et unité des langages de programmation",
                      "capacites": "Repérer, dans un nouveau langage de programmation, les traits communs et les traits particuliers à ce langage.",
                      "commentaires": "Les manières dont un même programme simple s'écrit dans différents langages sont comparées.",
                      "id_partie": 8
                    },
                    {
                      "id": 24,
                      "contenu": "Spécification",
                      "capacites": "Prototyper une fonction.\n\nDécrire les préconditions sur les arguments.\n\nDécrire les postconditions sur les résultats.",
                      "commentaires": "Des assertions peuvent être utilisées pour garantir des préconditions ou des postconditions.",
                      "id_partie": 8
                    },
                    {
                      "id": 25,
                      "contenu": "Mise au point des programmes",
                      "capacites": "Utiliser des jeux de tests.",
                      "commentaires": "L'importance de la qualité et du nombre des tests est mise en évidence.\n\nLe succès d'un jeu de tests ne garantit pas la correction d'un programme.",
                      "id_partie": 8
                    },
                    {
                      "id": 26,
                      "contenu": "Utilisation de bibliothèques",
                      "capacites": "Utiliser la documentation d'une bibliothèque.",
                      "commentaires": "Aucune connaissance exhaustive d'une bibliothèque particulière n'est exigible.",
                      "id_partie": 8
                    }
                  ]
                },
                {
                  "id": 9,
                  "label": "Algorithmique",
                  "commentaires": "Le concept de méthode algorithmique est introduit ; de nouveaux exemples seront vus en terminale. Quelques algorithmes classiques sont étudiés. L’étude de leurs coûts respectifs prend tout son sens dans le cas de données nombreuses, qui peuvent être préférentiellement des données ouvertes.\n\nIl est nécessaire de montrer l’intérêt de prouver la correction d’un algorithme pour lequel on dispose d’une spécification précise, notamment en mobilisant la notion d’invariant sur des exemples simples. La nécessité de prouver la terminaison d’un programme est mise en évidence dès qu’on utilise une boucle non bornée (ou, en terminale, des fonctions récursives) grâce à la mobilisation de la notion de variant sur des exemples simples.",
                  "id_matiere": 1,
                  "items": [
                    {
                      "id": 27,
                      "contenu": "Parcours séquentiel d'un tableau",
                      "capacites": "Écrire un algorithme de recherche d’une occurrence sur des valeurs de type quelconque.\n\nÉcrire un algorithme de recherche d’un extremum, de calcul d’une moyenne.",
                      "commentaires": "On montre que le coût est linéaire.",
                      "id_partie": 9
                    },
                    {
                      "id": 28,
                      "contenu": "Tris par insertion, par sélection",
                      "capacites": "Écrire un algorithme de tri.\n\nDécrire un invariant de boucle qui prouve la correction des tris par insertion, par sélection.",
                      "commentaires": "La terminaison de ces algorithmes est à justifier.\n\nOn montre que leur coût est quadratique dans le pire cas.",
                      "id_partie": 9
                    },
                    {
                      "id": 29,
                      "contenu": "Algorithme des k plus proches voisins",
                      "capacites": "Écrire un algorithme qui prédit la classe d’un élément en fonction de la classe majoritaire de ses k plus proches voisins.",
                      "commentaires": "Il s’agit d’un exemple d’algorithme d’apprentissage.",
                      "id_partie": 9
                    },
                    {
                      "id": 30,
                      "contenu": "Recherche dichotomique dans un tableau trié",
                      "capacites": "Montrer la terminaison de la recherche dichotomique à l’aide d’un variant de boucle.",
                      "commentaires": "Des assertions peuvent être utilisées.\n\nLa preuve de la correction peut être présentée par le professeur.",
                      "id_partie": 9
                    },
                    {
                      "id": 31,
                      "contenu": "Algorithmes gloutons",
                      "capacites": "Résoudre un problème grâce à un algorithme glouton.",
                      "commentaires": "Exemples : problèmes du sac à dos ou du rendu de monnaie.\n\nLes algorithmes gloutons constituent une méthode algorithmique parmi d’autres qui seront vues en terminale.",
                      "id_partie": 9
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": 2,
          "label": "Seconde",
          "id_univers": 1,
          "abrv": "2nde",
          "matieres": [
            {
              "id": 2,
              "id_niveau": 2,
              "label": "SNT",
              "comment": "SNT 2nde",
              "parties": [
                {
                  "id": 10,
                  "label": "Internet",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": [
                    {
                      "id": 32,
                      "contenu": "Protocole TCP/IP : paquets, routage des paquets",
                      "capacites": "Distinguer le drôle des protocoles IP et TCP.\n\nCaractériser les principes du routage et ses limites.\n\nDistinguer la fiabilité de transmission et l'absence de garantie temporelle.",
                      "commentaires": "",
                      "id_partie": 10
                    },
                    {
                      "id": 33,
                      "contenu": "Adresses symboliques et serveurs DNS",
                      "capacites": "Sur des exemples réels, retrouver une adresse IP à partir d'une adresse symbolique et inversement.",
                      "commentaires": "",
                      "id_partie": 10
                    },
                    {
                      "id": 34,
                      "contenu": "Réseaux pair-à-pair",
                      "capacites": "Décrire l'intérêt des réseaux pair-à-pair ainsi que les usages illicites qu'on peut en faire.",
                      "commentaires": "",
                      "id_partie": 10
                    },
                    {
                      "id": 35,
                      "contenu": "Indépendance d'internet par rapport au réseau physique",
                      "capacites": "Caractériser quelques types de réseaux physiques : obsolètes ou actuels, rapides ou lents, filaires ou non.\n\nCaractériser l'ordre de grandeur du trafic de données sur internet et son évolution.",
                      "commentaires": "",
                      "id_partie": 10
                    },
                    {
                      "id": 60,
                      "contenu": "Confidentialité",
                      "capacites": "Régler les paramètres de confidentialité d’un téléphone pour partager ou non sa position. ",
                      "commentaires": "",
                      "id_partie": 10
                    }
                  ]
                },
                {
                  "id": 11,
                  "label": "Le Web",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": [
                    {
                      "id": 36,
                      "contenu": "Repères historiques",
                      "capacites": "Connaître les étapes du développement du *Web*.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 37,
                      "contenu": "Notions juridiques",
                      "capacites": "Connaître certaines notions juridiques (licence, droit d'auteur, droit d'usage, valeur d'un bien.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 38,
                      "contenu": "Hypertexte",
                      "capacites": "Maîtriser les renvois d'un texte à différents contenus.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 39,
                      "contenu": "Langages HTML et CSS",
                      "capacites": "Distinguer ce qui relève du contenu d'une page et de son style de présentation.\n\nÉtudier et modifier une page HTML simple.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 40,
                      "contenu": "URL",
                      "capacites": "Décomposer l'URL d'une page.\n\nReconnaître les pages sécurisées.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 41,
                      "contenu": "Requête HTTP",
                      "capacites": "Décomposer le contenu d'une requête HTTP et identifier les paramètres passés.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 42,
                      "contenu": "Modèle client/serveur",
                      "capacites": "Inspecter le code d'une page hébergée par un serveur et distinguer ce qui est exécuté par le client et par le serveur.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 43,
                      "contenu": "Moteurs de recherche : principes et usages",
                      "capacites": "Mener une analyse critique des résultats fournis par un moteur de recherche.\n\nComprendre les enjeux de la publication d'informations.",
                      "commentaires": "",
                      "id_partie": 11
                    },
                    {
                      "id": 44,
                      "contenu": "Paramètres de sécurité d'un navigateur",
                      "capacites": "Maîtriser les réglages les plus importants concernant la gestion des cookies, la sécurité et la confidentialité d'un navigateur.\n\nSécuriser sa navigation en ligne et analyser les pages et fichiers.",
                      "commentaires": "",
                      "id_partie": 11
                    }
                  ]
                },
                {
                  "id": 12,
                  "label": "Les réseaux sociaux",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": [
                    {
                      "id": 45,
                      "contenu": "Identité numérique, e-réputation, identification, authentification",
                      "capacites": "Connaître les principaux concepts liés à l'usage des réseaux sociaux.",
                      "commentaires": "",
                      "id_partie": 12
                    },
                    {
                      "id": 46,
                      "contenu": "Réseaux sociaux existants",
                      "capacites": "Distinguer plusieurs réseaux sociaux selon leurs caractéristiques, y compris un ordre de grandeur de leurs nombres d'abonnés.\n\nParamétrer des abonnements pour assurer la confidentialité de données personnelles.",
                      "commentaires": "",
                      "id_partie": 12
                    },
                    {
                      "id": 47,
                      "contenu": "Modèle économique des réseaux sociaux",
                      "capacites": "Identifier les sources de revenus des entreprises de réseautage social.",
                      "commentaires": "",
                      "id_partie": 12
                    },
                    {
                      "id": 48,
                      "contenu": "Rayon, diamètre et centre d'un graphe",
                      "capacites": "Déterminer ces caractéristiques sur des graphes simples.",
                      "commentaires": "",
                      "id_partie": 12
                    },
                    {
                      "id": 49,
                      "contenu": "Notion de \"petit monde\"\n\nExpérience de Milgram",
                      "capacites": "Décrire comment l'information présentée par les réseaux sociaux est conditionnée par le choix préalable de ses amis.",
                      "commentaires": "",
                      "id_partie": 12
                    },
                    {
                      "id": 50,
                      "contenu": "Cyberviolence",
                      "capacites": "Connaître les dispositions de l'article 222-33-2-2 du code pénal.\n\nConnaître les différentes formes de cyberviolence (harcèlement, discrimination, sexting...) et les ressources disponibles pour lutter contre la cyberviolence.",
                      "commentaires": "",
                      "id_partie": 12
                    }
                  ]
                },
                {
                  "id": 13,
                  "label": "Les données structurées et leur traitement",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": [
                    {
                      "id": 51,
                      "contenu": "Données",
                      "capacites": "Définir une donnée personnelle.\n\nIdentifier les principaux formats et représentations de données.",
                      "commentaires": "",
                      "id_partie": 13
                    },
                    {
                      "id": 52,
                      "contenu": "Données structurées",
                      "capacites": "Identifier les différents descripteurs d'un objet.\n\nDistinguer la valeur d'une donnée de son descripteur.\n\nUtiliser un site de données ouvertes, pour sélectionner et récupérer des données.",
                      "commentaires": "",
                      "id_partie": 13
                    },
                    {
                      "id": 53,
                      "contenu": "Traitement de données structurées",
                      "capacites": "Réaliser des opérations de recherche, filtre, tri ou calcul sur une ou plusieurs tables.",
                      "commentaires": "",
                      "id_partie": 13
                    },
                    {
                      "id": 54,
                      "contenu": "Métadonnées",
                      "capacites": "Retrouver les métadonnées d'un fichier personnel.",
                      "commentaires": "",
                      "id_partie": 13
                    },
                    {
                      "id": 55,
                      "contenu": "Données dans le nuage (*cloud*)",
                      "capacites": "Utiliser un support de stockage dans le nuage.\n\nPartager des fichiers, paramétrer des modes de synchronisation.\n\nIdentifier les principales causes de la consommation énergétique des centres de données ainsi que leur ordre de grandeur.",
                      "commentaires": "",
                      "id_partie": 13
                    }
                  ]
                },
                {
                  "id": 14,
                  "label": "Localisation, cartographie et mobilité",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": [
                    {
                      "id": 56,
                      "contenu": "GPS, Galileo",
                      "capacites": "Décrire le principe de fonctionnement de la géolocalisation.",
                      "commentaires": "",
                      "id_partie": 14
                    },
                    {
                      "id": 57,
                      "contenu": "Cartes numériques",
                      "capacites": "Identifier les différentes couches d’information de GeoPortail pour extraire différents types de données.\n\nContribuer à OpenStreetMap de façon collaborative.",
                      "commentaires": "",
                      "id_partie": 14
                    },
                    {
                      "id": 58,
                      "contenu": "Protocole NMEA 0183",
                      "capacites": "Décoder une trame NMEA pour trouver des coordonnées géographiques.",
                      "commentaires": "",
                      "id_partie": 14
                    },
                    {
                      "id": 59,
                      "contenu": "Calculs d’itinéraires",
                      "capacites": "Utiliser un logiciel pour calculer un itinéraire.\n\nReprésenter un calcul d’itinéraire comme un problème sur un graphe.",
                      "commentaires": "",
                      "id_partie": 14
                    }
                  ]
                },
                {
                  "id": 15,
                  "label": "Informatique embarquée et objets connectés",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": []
                },
                {
                  "id": 16,
                  "label": "La photographie numérique",
                  "commentaires": "",
                  "id_matiere": 2,
                  "items": []
                }
              ]
            }
          ]
        }
      ]
    }